"""Пользователь вводит номер дня недели например, `2`, программа сообщает его название на  казахском или болгарском языке

(выберите сами для какого  языка писать код)

Понеделник
Вторник
Сряда
Четвъртък
Петък
Събота
Неделя


дүйсенбi
сейсенбi
сәрсенбі
бейсенбі
жұма
сенбі
жексенбi
"""
latter_days = ["Понеделник", "Вторник", "Сряда", "Четвъртък", "Петък", "Събота", "Неделя"]
number_days = int(input("Введите номер дня: "))


for day in latter_days:
    pass
print(latter_days[number_days -1])

