"""
Напишите функцию print_line(x) которая печатает строку звездочек выделенной длины

# Если x = 7

*******
"""

def print_line(x):
    return "*" * x

total = print_line(7)
print(total)